import pandas as pd
import pytest


@pytest.fixture
def create_excel_file(tmp_path):
    file_path = tmp_path / "test_data.xlsx"
    df = pd.DataFrame({"column1": [1, 2, 3], "column2": [4, 5, 6]})
    df.to_excel(file_path, index=False)
    return file_path


@pytest.fixture
def sample_data():
    """
    Фикстура для предоставления тестовых данных.
    """
    data = {
        "Дата операции": ["2025-01-01", "2025-01-02", "2025-01-03", "2025-01-04", "2025-01-05"],
        "Сумма платежа": [100, 200, 150, 50, 300],
    }
    return pd.DataFrame(data)


@pytest.fixture
def sample_data_services():
    """Фикстура с тестовыми данными."""
    return [
        {"Дата операции": "01.12.2021 12:00:00", "Категория": "Супермаркеты", "Сумма операции": -1000},
        {"Дата операции": "02.12.2021 12:00:00", "Категория": "Рестораны", "Сумма операции": -500},
        {"Дата операции": "03.12.2021 12:00:00", "Категория": "Супермаркеты", "Сумма операции": -2000},
        {"Дата операции": "04.12.2021 12:00:00", "Категория": "Переводы", "Сумма операции": -1000},
        {"Дата операции": "05.12.2021 12:00:00", "Категория": "Транспорт", "Сумма операции": -300},
    ]
